# RebarBarHookLengths Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarBarHookLengths Property
ParameterTypeId Class See Also
---
"Hook Lengths"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarBarHookLengths { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarBarHookLengths As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarBarHookLengths {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace